Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6410.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRG1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFAF">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRG1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SPBRG1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="PSPCON" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="PSPCON" edc:nzwidth="0x8" edc:por="0000----" edc:_addr="0xFB0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PSPMODE" edc:desc="" edc:mask="0x1" edc:name="PSPMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBOV" edc:desc="" edc:mask="0x1" edc:name="IBOV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OBF" edc:desc="" edc:mask="0x1" edc:name="OBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBF" edc:desc="" edc:mask="0x1" edc:name="IBF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T3CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="T3CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFB1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3ON" edc:desc="" edc:mask="0x1" edc:name="TMR3ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3CS" edc:desc="" edc:mask="0x1" edc:name="TMR3CS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nT3SYNC" edc:desc="" edc:mask="0x1" edc:name="nT3SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CCP1" edc:desc="" edc:mask="0x1" edc:name="T3CCP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS" edc:desc="" edc:mask="0x3" edc:name="T3CKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="T3CCP2" edc:desc="" edc:mask="0x1" edc:name="T3CCP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="T3CKPS0" edc:desc="" edc:mask="0x1" edc:name="T3CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS1" edc:desc="" edc:mask="0x1" edc:name="T3CKPS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T3SYNC" edc:desc="" edc:mask="0x1" edc:name="T3SYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T3INSYNC" edc:desc="" edc:mask="0x1" edc:name="T3INSYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="SOSCEN3" edc:desc="" edc:mask="0x1" edc:name="SOSCEN3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RD163" edc:desc="" edc:mask="0x1" edc:name="RD163" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="T3RD16" edc:desc="" edc:mask="0x1" edc:name="T3RD16" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR3" edc:desc="" edc:name="TMR3" edc:nzwidth="0x10" edc:_addr="0xFB2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3" edc:desc="" edc:mask="0xffff" edc:name="TMR3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3L" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFB2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3H" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xFB3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR3H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR3H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
